<template>
	<view class="page">
		<view class="useh1">逸充新能源注册服务协议</view>
		<view class="vwarp">1.服务条款的确认及接受</view>
		<view>
			1.1您应当仔细阅读本协议条款并按照页面上的提示完成全部的注册程序。您在注册程序过程中选择“同意”选项即表示您自愿与“逸充新能源”达成协议，同意完全接受本协议项下的全部条款，愿意承担相应的用户义务，并成为“逸充新能源”用户。
		</view>
		<view>
			1.2为方便联系您以解决各项事宜，请您注册时使用本人有效手机号码作为账号，“逸充新能源”会以手机短信形式为该账号分配一个密码。该账号及相应的密码由您负责保管；您应当对该账号进行的所有活动和事件承担法律责任。如您发现账号遭他人非法使用，请您立即通知“逸充新能源”。
		</view>
		<view>
			1.3“逸充新能源”会员服务协议和公告将会随时更新，且不再另行通知。您在使用“逸充新能源”所提供的各项服务之前，应仔细阅读会员服务协议和公告。如您不同意更新后的服务协议或公告，您可以停止或取消使用“逸充新能源”所提供的服务；您一旦使用“逸充新能源”服务，即视为您已了解并完全同意会员服务协议的各项内容，包括“逸充新能源”对服务协议所做的修改。
		</view>
		<view class="vwarp">2.注册信息和隐私保护</view>
		<view>2.1“逸充新能源”账号(即“逸充新能源”用户D)的所有权归属于“逸充新能源”，您完成注册申请手续后，可获得“逸充新能源”账号的使用权，成为“逸充新能源”的用户。</view>
		<view>
			2.2您应及时填写详尽、准确、完整的个人资料，并不断更新注册资料，并保证注册资料符合真实、及时、详尽、准确、完整的要求。所有原始填入的资料均作为注册资料。如因注册信息不真实或更新不及时而引发的相关问题，将由您自行承担相应的责任，“逸充新能源”不承担任何责任，并且“逸充新能源”保留终止您使用各项服务的权利。
		</view>
		<view>
			2.3为保障您账户的安全，我们可能采取不同的验证措施验证您的身份，验证方式包括但不限于短信验证码、服务使用信息验证等。且因系统服务将涉及在线支付，适用于您与商户间发生的包括但不限于服务纠纷、付款错误、退款等情况，为方便及时联系与您确认，请您务必使用本人真实有效的手机号码进行账号注册，并保持通讯畅通。因系统服务将涉及在线支付，适用于您与商户间发生的包括但不限于服务纠纷、付款错误、退款等情况，为方便及时联系与您确认，“逸充新能源”强烈要求您使用真实的手机号码进行账号注册。
		</view>
		<view>2.4“逸充新能源”提示您请勿将账号、密码转让、出售或借予他人使用，若您授权他人使用账号，对被授权人在该账户下实施的所有行为您须承担全部责任。</view>
		<view>2.5“逸充新能源”承诺不对外公开或向第三方提供单个用户的注册资料，以下情况除外：</view>
		<view>2.5.1事先获得用户的明确授权；</view>
		<view>2.5.2只有透露用户个人资料，才能提供其所要求的产品和服务；</view>
		<view>2.5.3根据有关的法律法规要求；</view>
		<view>2.5.4按照相关政府主管部门的要求；</view>
		<view>2.5.5为维护“逸充新能源”的合法权益；</view>
		<view>2.5.6您使用共享功能；</view>
		<view>2.5.7符合相关服务条款或使用协议的规定；</view>
		<view>2.5.8其余“逸充新能源”有理由公开的情形。</view>
		<view>
			2.6您在注册“逸充新能源”账号，使用“逸充新能源”产品或服务，访问“逸充新能源”网页，或参加促销和有奖游戏等类似情形时，“逸充新能源”将会自动收集您的个人身份识别资料且不再另行通知您。这些资料将会用于：改进并优化为您提供的服务及网页内容。
		</view>
		<view class="vwarp">3.用户行为规范</view>
		<view>3.1您在使用“逸充新能源”服务时，必须遵守中华人民共和国相关法律法规的规定，不得利用本服务进行任何违法或不正当的活动，包括但不限于下列行为：</view>
		<view>3.11上载、展示、张贴、传播或以其他方式传达含有下列内容之一的信息：</view>
		<view>3.1.1.1反对宪法所确定的基本原则的；</view>
		<view>3.11.2危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</view>
		<view>3.1.1.3损害国家荣誉和利益的；</view>
		<view>3.1.1.4煽动民族仇恨、民族歧视、破坏民族团结的；</view>
		<view>3.1.1.5破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
		<view>3.1.1.6散布谣言，扰乱社会秩序，破坏社会稳定的；</view>
		<view>3.11.7散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
		<view>3.1.1.8侮辱或者诽谤他人，侵害他人合法权利的；</view>
		<view>3.1.1.9含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵或其它道德上令人反感的内容；</view>
		<view>3.1.1.10含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；</view>
		<view>3.1.2不得为任何非法目的而使用网络服务系统；</view>
		<view>3.1.3不得利用“逸充新能源”服务从事以下活动：</view>
		<view>3.1.3.1未经允许，进入计算机信息网络或者使用计算机信息网络资源的；</view>
		<view>3.1.3.2未经允许，对计算机信息网络功能进行删除、修改或者增加的；</view>
		<view>3.1.3.3未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或增加的；</view>
		<view>3.1.3.4故意制作、传播计算机病毒等破坏性程序的；</view>
		<view>3.1.3.5其他危害计算机信息网络安全的行为。</view>
		<view>
			3.2如您违反本协议或相关服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费在内，您同意赔偿“逸充新能源”及其合作公司、关联公司，并使之免受损害。对此，“逸充新能源”有权根据您的行为性质，采取包括但不限于删除发布的信息内容、暂停使用许可、终止服务、限制使用、回收“逸充新能源”账号、追究法律责任等措施。对恶意注册“逸充新能源”账号或利用“逸充新能源”账号进行违法活动，捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，“逸充新能源”有权回收其账号。同时，“逸充新能源”会视司法部门的要求，协助调查。
		</view>
		<view>3.3您不得将“逸充新能源”服务任何部分或基于“逸充新能源”服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其他目的。</view>
		<view>
			3.4您须对自己在使用“逸充新能源”服务过程中的行为承担法律责任。您承担法律责任的形式包含但不限于：直接对受到侵害者进行赔偿，以及在“逸充新能源”因您的行为遭受行政处罚或导致侵权损害赔偿后，给予“逸充新能源”等额的赔偿；并承担法律规定的其他法律责任。
		</view>
		<view class="vwarp">4.服务内容</view>
		<view>4.1“逸充新能源”网络服务的具体内容由“逸充新能源”根据实际情况提供。</view>
		<view>4.2除非本服务协议另有其他明示规定，“逸充新能源”推出的新产品、新功能、新服务，均受到本服务协议之规范。</view>
		<view>
			4.3为使用本服务，您必须经有提供互联网接入服务法律资格的第三方以进入国际互联网，并自行支付相关服务费用。此外，您必须自行配备及负责与国际互联网连线所需之一切必要装备，包括但不限于计算机、数据机或其它存取装置。
		</view>
		<view>
			4.4鉴于网络服务的特殊性，您知悉且同意“逸充新能源”无需事先通知，有权随时变更、中断或终止部分或全部网络服务（包括收费网络服务）。“逸充新能源”对网络服务是否存在中断可能性，以及网络服务的及时性、安全性、准确性均不作保证。
		</view>
		<view>
			4.5“逸充新能源”将定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，您知悉并同意因此类情况而造成的网络服务（包括收费网络服务）在合理时间内的中断，“逸充新能源”无需为此承担任何责任，且“逸充新能源”无需事先通知用户，有权为维修、保养、升级或其它目的而暂停任何服务。
		</view>
		<view>
			4.6本服务提供过程中及第三人可自由提供其它国际互联网之网站或资源链接。由于“逸充新能源”无法控制这些网站及资源信息的发布，您已了解并同意，对此类网站或资源是否具有可利用性，“逸充新能源”不作保证且不承担任何责任，对存在或源于此类网站或资源之任何内容、广告、产品或其它资料，“逸充新能源”亦不作保证且不承担任何责任。因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、商品或服务所产生的任何损害或损失，“逸充新能源”不承担任何责任。
		</view>
		<view>
			4.7您明确同意在使用“逸充新能源”网络服务过程中产生的风险将完全由其自己承担。确认由您独立作出下载或通过“逸充新能源”服务取得信息资料的行为，并愿意承担可能发生的系统受损、资料丢失以及其他任何风险。
		</view>
		<view>
			4.8终止服务：您同意“逸充新能源”有权基于其自身之考虑，因任何原因，包含但不限于您长时间未使用，或“逸充新能源”认为您已经违反本服务协议的文字及精神，终止您的密码、账号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本服务协议规定而提供之服务，“逸充新能源”无需进行事先通知即可中断或终止；您承认并同意，“逸充新能源”可随时关闭或删除您的账号及您账号中所有相关信息及文件，及/或禁止您继续使用前述文件或本服务。此外，您同意出现本服务之使用被中断、终止或您的账号及相关信息和文件被关闭、删除的情形，“逸充新能源”对您或任何第三人均不承担任何责任。
		</view>
		<view>4.9逸充新能源考虑资源充分利用，特提醒您：在您使用充电桩充电时，即插即充，即停即拔。超出相应时间，逸充新能源将会收取您设备占用费，具体服务按逸充新能源公示为准。</view>
		<view class="vwarp">5.知识产权和其他合法权益（包括但不限于名誉权、商誉权）</view>
		<view>5.1知识产权：</view>
		<view>
			5.1.1“逸充新能源”所包含的全部成果包括但不限于数据库、网站设计、文字和图表、软件、照片、录像、音乐、声音及其前述组合，软件编译、相关源代码和软件（包括小应用程序和脚本）的知识产权权利均归“逸充新能源”所有。未经特殊书面授权您不得为任何目的复制、更改、拷贝、发送或使用前述任何材料或内容。
		</view>
		<view>5.1.2“逸充新能源”名称中包含的所有权利（包括商誉和商标）均归“逸充新能源”所有。</view>
		<view>
			5.1.3您接受本协议即视为已知悉并自愿主动将在“逸充新能源”系统平台及相关区域发表的任何形式的信息的著作权，包括但不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他财产权利长期无偿独占许可给“逸充新能源”使用，“逸充新能源”有权利就任何主体对上述著作权的侵权行为单独提起诉讼并获得全部赔偿。本协议属于《中华人民共和国著作权法》第二十五条规定的书面协议，其效力及于您在“逸充新能源”发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。您请勿在“逸充新能源”系统平台及相关区域内发布您无权使用或需保留著作权的信息材料，对此“逸充新能源”将不再进行通知，因此而产生的侵权责任或权利纠纷，将由您自己承担责任。
		</view>
		<view>
			5.1.4您在使用“逸充新能源”服务过程中不得非法使用或处分“逸充新能源”或他人的知识产权权利。您不得将已发表于“逸充新能源”的信息以任何形式发布或授权其它网站（及媒体）使用。
		</view>
		<view>
			5.1.5逸充新能源为提供服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的辅助材料）的全部权利均属于逸充新能源，未经逸充新能源许可，您不得对该软件进行反向工程(reverse
			engineer)、反向编译(decompile)或反汇编(disassemble)等侵犯逸充新能源合法权益的行为。
		</view>
		<view>
			5.1.6“逸充新能源”所刊载的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件等），均是“逸充新能源”或其内容提供者的财产，受中国和国际版权法的保护。“逸充新能源”上所有内容的汇编是“逸充新能源”的排他财产，受中国和国际版权法的保护。“逸充新能源”上所有软件都是“逸充新能源”或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。
		</view>
		<view>5.1.7除法律另有强制性规定外，未经“逸充新能源”明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用“逸充新能源”的信息内容，否则，“逸充新能源”有权追究其法律责任。</view>
		<view>5.2“逸充新能源”无须任何人同意有权修改或终止本协议。</view>
		<view class="vwarp">6.其他</view>
		<view>6.1本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</view>
		<view>6.2如双方就本协议内容或其执行发生任何争议，双方应通过友好协商的方式进行解决；协商不成时，任何一方均可向“逸充新能源”所在地有管辖权的人民法院提起诉讼。</view>
	</view>
</template>

<script>
export default {
	components: {},
	data() {
		return {};
	},
	onLoad() {},
	methods: {
		/*  */
	}
};
</script>

<style lang="scss" scoped>
page {
	height: 100%;
	background: #fff;
	padding-bottom: 20rpx;
	border-top: 1px solid #ddd;
}
.page {
	background: #fff;
	padding: 20rpx 4%;
	color: #666;
	font-size: 30rpx;
	line-height: 2;
}
view {
	padding-bottom: 10rpx;
	text-indent: 2em;
}
.vwarp {
	padding-top: 20rpx !important;
	text-indent: 0em !important;
	font-weight: 550;
	color: #333;
	font-size: 32rpx;
}

.useh1 {
	font-size: 38rpx;
	font-weight: bold;
	line-height: 3;
	color: #333;
	text-align: center;
	text-indent: 0em !important;
}
.bold {
	font-weight: 550;
	color: #333;
	font-size: 32rpx;
}
</style>
