<template>
	<view class="page">
		<view>
			<text class="bold">福建逸充物联网科技有限公司</text>
			(以下简称“我们”)深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
			请在使用我们的产品（或服务）前，仔细阅读并了解本
			<text class="bold">《隐私政策》</text>
			。
		</view>
		<view class="vwarp">一、我们如何收集和使用您的个人信息</view>
		<view>
			个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：
		</view>
		<view>
			（一）帮助您成为我们的用户
			您首先需要注册一个逸充新能源账号成为逸充新能源用户。当您注册时，您需要向我们提供您准备使用的注册手机号，我们将通过发送短信验证码的方式来验证您的身份是否有效。注册成功后，您可以修改补充您的头像、昵称、生日以及登录密码，这些信息均属于您的“账户信息”。您补充的账户信息将有助于我们为您提供如会员生日特权等会员特权。但如果您不提供这些补充信息，将会影响到您使用会员服务，但不会影响您使用充值、充电等功能。
		</view>
		<view>（二）向您提供产品/服务</view>
		<view>1、您向我们提供的个人信息</view>
		<view>
			（1）支付：您在逸充新能源上支付订单时，您可以选择第三方支付机构（如微信支付分、支付宝信用支付）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的逸充新能源订单信息及对账信息与这些支付机构共享以确认您的支付指令并完成支付。
		</view>
		<view>
			(2)客服：当您与我们的客服取得联系时，我们的系统可能会记录您与客服之间的通讯记录，以及使用您的账号信息以便核验身份；当您需要我们提供与您订单相关的客户服务时，我们可能会查询您的相关订单信息以便给予您适当的帮助和处理；当您需要客服协助您修改有关信息时，您可能还需要提供上述信息外的其他信息以便完成修。
		</view>
		<view>
			2、我们在您使用服务过程中可能收集的个人信息为了满足法律法规及提供服务的基本要求，保障您的账号安全与系统运行安全，我们会收集您在使用我们服务过程中产生的相关信息，包括：
		</view>
		<view>
			(1)日志信息：当您使用我们提供的产品/服务时，我们会自动收集您使用我们服务的详细情况，并作为有关的网络日志保存，包括但不限于您的P地址、操作系统的版本、访问的旦期和时间、及您请求的页面记录等信息。
		</view>
		<view>
			(2)位置信息：为了便于您发现周边的充电站，我们会基于您的地理位置为您提供服务(LBS)。当您开启设备定位功能并使用我们的LBS时，我们可能会收集和使用您的位置信息，以实现我们为您查询周边充电站的目的。我们会使用有关技术对您的实际位置进行定位，这些技术包括P地址、GPS以及能够提供相关信息的Wi-Fⅰ接入点、蓝牙和基站等传感器技术。请您注意，大多数移动设备都允许您关闭定位服务，具体方法建议您参考或联系您移动设备的服务商或生产商，一旦您通过系统授权关闭定位功能，停止我们对您位置信息的收集，您将可能无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。
		</view>
		<view>
			(3)设备信息：我们可能会根据您在软件安装及使用中的具体权限，接收并记录您在接受我们服务过程中使用的相关设备信息，例如设备型号、唯一设备标识符、操作系统、分辨率、电信运营商等软硬件信息等。
		</view>
		<view>
			(4)为使您能够使用和享受相应的服务及功能，我们会在逸充新能源APP中嵌入第三方的SDK,我们将审慎评估该等SDK的使用目的。有关SDK处理个人信息的目的、方式及范围等信息，请查看《第三方信息共享清单》
		</view>
		<view class="table">
			<view class="th">
				<text>SDK名称</text>
				<text>处理方式</text>
				<text>处理目的</text>
			</view>
			<view>
				<text>诸葛1O</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text>统计</text>
			</view>
			<view>
				<text>高德地图</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text>用户定位</text>
			</view>
			<view>
				<text>支付宝</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text>支付</text>
			</view>
			<view>
				<text>银联</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text>支付</text>
			</view>
			<view>
				<text>小米推送</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text>提送推送服务</text>
			</view>
			<view>
				<text>京东支付</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>友盟</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>极光推送</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>腾讯云IM</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>Udesk</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>VIVO推送</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>华为推送</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
			<view>
				<text>阿里云</text>
				<text>自动收集，且仅在启动APP、用户同意隐私政策后收集</text>
				<text></text>
			</view>
		</view>
		<view>对于从您使用相同逸充新能源账号登录各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。</view>
		<view>（三）为您提供安全保障</view>
		<view>
			为提高您使用我们提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会使用或整合您的个人信息以及我们的关联方、合作伙伴取得您授权或者依法共享的信息，根据您的使用习惯和常用软件信息等来综合判断您的账号及交易风险，包括验证身份、预防、发现、调查可能存在的欺诈、网络病毒、网络攻击等安全风险以及违反我们或关联方协议、政策或规则等行为，以保护您、其他用户、我们或关联方的合法权益，并记录一些我们认为有风险的链接(“URL”)。
		</view>
		<view>（四）其他用途</view>
		<view>我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。</view>
		<view>（五）请您知悉，以下情形中，我们收集、使用个人信息无需征得您的授权同意：</view>
		<view>1、与国家安全、国防安全有关的；</view>
		<view>2、与公共安全、公共卫生、重大公共利益有关的；</view>
		<view>3、与犯罪侦查、起诉、审判和判决执行等有关的；</view>
		<view>4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
		<view>5、所收集的个人信息是个人信息主体自行向社会公众公开的；</view>
		<view>6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</view>
		<view>7、根据您的要求签订合同所必需的；</view>
		<view>8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</view>
		<view>9、为合法的新闻报道所必需的；</view>
		<view>10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时。对结果中所包含的个人信息进行去标识化处理的；</view>
		<view>
			11、法律法规规定的其他情形。请注意，无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将无法与任何特定个人建立联系的数据与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类信息将被视为个人信息。
		</view>
		<view class="vwarp">二、我们如何使用Cookie和同类技术</view>
		<view>（一）Cookies的使用</view>
		<view>
			1、为实现您联机体验的需求，使您获得更轻松的访问体验。我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。
		</view>
		<view>
			2、我们不会将Cookies用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookies.。您可以清除设备上保存的所有Cookies,大部分网络浏览器会自动接受Cookies,但您通常可根据自己的需要来修改浏览器的设置以拒绝Cookies;另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，您可能需要在每一次访问逸充新能源时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。
		</view>
		<view>（二）网络Beacon和同类技术的使用</view>
		<view>除Cookie外，我们还会在网站上使用网络Beacon等其他同类技术。我们的网页上常会包含一些电子图像(称为"单像素"GlF文件或"网络beacon")。我们使用网络beacon的方式有：</view>
		<view>1、通过在逸充新能源软件上使用网络beacon,计算用户访问数量，并通过访问cookie辨认注册的逸充新能源用户。</view>
		<view>2、通过得到的cookies信息，为您提供服务。</view>
		<view class="vwarp">三、我们如何共享、转让、公开披露您的个人信息</view>
		<view>（一）共享</view>
		<view>我们不会向其他任何公司、组织和个人分享您的个人信息：</view>
		<view>1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。</view>
		<view>2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。</view>
		<view>
			3、与我们的关联公司共享：您的个人信息可能会与我们关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
		</view>
		<view>
			4、与合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。在这种情况下，这些公司必须遵守我们的数据隐私和安全要求。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
		</view>
		<view>（二）转让</view>
		<view>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</view>
		<view>1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；</view>
		<view>
			2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会再要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
		</view>
		<view>（三）公开披露</view>
		<view>我们仅会在以下情况下，公开披露您的个人信息：</view>
		<view>1、获得您明确同意后；</view>
		<view>2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。</view>
		<view class="vwarp">四、我们如何保护您的个人信息</view>
		<view>
			（一）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受SSL加密保护；我们同时对我们网站提供https安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
		</view>
		<view>（二）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。</view>
		<view>
			（三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
		</view>
		<view>
			（四）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
		</view>
		<view>
			（五）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
		</view>
		<view class="vwarp">五、您如何管理您的个人信息</view>
		<view>逸充新能源非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：</view>
		<view>1、访问和更正您的个人信息</view>
		<view>除法律法规规定外，您有权随时访问和更正您的个人信息，具体包括：</view>
		<view>(1)您的账户信息：您可以在逸充新能源App中点击我”页面的头像，查看和管理您提交给逸充新能源的所有个人信息。</view>
		<view>(2)您的订单信息：您可以在逸充新能源App中点击“订单”页面，查看您的历史订单信息。</view>
		<view>(3)对于您在使用我们的产品与/或服务过程中产生的其他个人信息需要访问或更正，请随时联系我们。我们会根据本隐私政策所列明的方式和期限响应您的请求。</view>
		<view>
			(4)您无法访问和更正的个人信息：除上述列明的信息外，您的部分个人信息我们还无法为您提供访问和更正的服务，这些信息主要是为了提升您的用户体验和保证交易安全所收集的您的设备信息、您使用附加功能时产生的个人信息。上述信息我们会在您的授权范围内进行使用，您无法访问和更正，但您可联系我们进行删除或做匿名化处理。
		</view>
		<view>2、删除您的个人信息</view>
		<view>在以下情形中，您可以向我们提出删除个人信息的请求：</view>
		<view>(1)如果我们处理个人信息的行为违反法律法规；</view>
		<view>(2)如果我们收集、使用您的个人信息，却未征得您的同意；</view>
		<view>(3)如果我们处理个人信息的行为违反了与您的约定；</view>
		<view>(4)如果您注销了逸充新能源账户；</view>
		<view>(5)如果我们终止服务及运营。</view>
		<view>
			若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
		</view>
		<view>3、改变您授权同意的范围或撤回您的授权</view>
		<view>
			您可以通过删除信息、关闭设备功能、在逸充新能源软件中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。
		</view>
		<view>
			请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。
		</view>
		<view>4、注销账户</view>
		<view>
			您可以注销账户。(点击我的-设置-注销账号)您注销账户后，我们将停止为您提供产品与/或服务，并依据您的要求，除法律法规另有规定外，我们将删除您的个人信息。收到您注销账户请求后，如需我们人工处理的，我们承诺在15个工作日内完成核查和处工处理的，我们承诺在15个工作日内完成核查和处理。
		</view>
		<view>5、响应您的请求</view>
		<view>
			如果您无法通过上述方式访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们产品与/或服务时所产生的其他个人信息，或您认为逸充新能源存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您可以通过本协议下方的方式与我们联系。为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的30天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
		</view>
		<view>在以下情形中，按照法律法规要求，我们将无法响应您的请求：</view>
		<view>(1)与国家安全、国防安全有关的；</view>
		<view>(2)与公共安全、公共卫生、重大公共利益有关的；</view>
		<view>(3)与犯罪侦查、起诉和审判等有关的；</view>
		<view>(4)有充分证据表明您存在主观恶意或滥用权利的；</view>
		<view>(5)响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。</view>
		<view class="vwarp">六、未成年人的个人信息保护</view>
		<view>
			1、逸充新能源非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用我们的产品与/或服务前，应事先取得您家长或法定监护人的书面同意。逸充新能源根据国家相关法律法规的规定保护未成年人的个人信息。
		</view>
		<view>2、对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。</view>
		<view>3、如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。</view>
		<view class="vwarp">七、通知和修订</view>
		<view>
			1、为给您提供更好的服务以及随着逸充新能源业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在逸充新能源网站、逸充新能源移动端上发出更新版本并在生效前通过适当方式提醒您相关内容的更新，也请您访问逸充新能源以便及时了解最新的隐私政策。
		</view>
		<view>2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。</view>
		<view>本政策所指的重大变更包括但不限于：</view>
		<view>(1)我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</view>
		<view>(2)我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</view>
		<view>(3)个人信息共享、转让或公开披露的主要对象发生变化；</view>
		<view>(4)您参与个人信息处理方面的权利及其行使方式发生重大变化；</view>
		<view>(5)我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</view>
		<view>(6)个人信息安全影响评估报告表明存在高风险时。</view>
		<view>3、我们还会将本策略的旧版本存档，供您查阅。</view>
		<view class="vwarp">八、如何联系我们</view>
		<view>1、如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请发送邮件至energy@eeyycc.cn或拨打我们的客服热线0591-87604266联系我们。</view>
		<view>
			2、一般情况下，我们将在三十天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以向网信、电信、公安及工商等监管部门进行投诉或举报。
		</view>
		<view>3、开发者名称：福建逸充物联网科技有限公司</view>
	</view>
</template>

<script>
export default {
	components: {},
	data() {
		return {};
	},
	onLoad() {},
	methods: {
		/*  */
	}
};
</script>

<style lang="scss" scoped>
page {
	height: 100%;
	background: #fff;
	padding-bottom: 20rpx;
	border-top: 1px solid #ddd;
}
.page {
	background: #fff;
	padding: 20rpx 4%;
	color: #666;
	font-size: 30rpx;
	line-height: 2;
}
.bold {
	font-weight: 550;
	color: #333;
	font-size: 32rpx;
}
view {
	padding-bottom: 10rpx;
	text-indent: 2em;
}
.vwarp {
	padding-top: 20rpx !important;
	text-indent: 0em !important;
	font-weight: 550;
	color: #333;
	font-size: 32rpx;
}
// 表格
.table {
	padding: 0 !important;
	text-indent: 0em !important;
	border-top: 1px solid #ddd;
	border-left: 1px solid #ddd;
	margin: 30rpx auto;
}
.table view {
	padding: 0 !important;
	text-indent: 0em !important;
	text-align: center;
	display: flex;
	align-items: stretch;
	justify-content: center;
	width: 100%;
	font-size: 30rpx;
	line-height: 1.7;

	text {
		width: 33.33%;
		border-right: 1px solid #ddd;
		border-bottom: 1px solid #ddd;
		padding: 30rpx 20rpx;
	}
}
.table .th {
	background: #efefef;
	line-height: 1;
	font-size: 26rpx;
	text {
		padding: 20rpx 0;
	}
}
</style>
